#include "BackGroundManager.h"


//-------------------------------
//		コンストラクタ
//-------------------------------
CBackGroundManager::CBackGroundManager()
{
}


//-------------------------------
//		デストラクタ
//-------------------------------
CBackGroundManager::~CBackGroundManager()
{
	// 本来は必要ないけど、念のため
	Fin();
}


//-------------------------------
//		初期化
//-------------------------------
void CBackGroundManager::Init()
{
	c_sky.Init();
}


//-------------------------------
//		データロード
//-------------------------------
void CBackGroundManager::Load()
{
}


//-------------------------------
//		毎フレーム呼ぶ処理
//-------------------------------
int  CBackGroundManager::Step()
{
	return 0;
}


//-------------------------------
//		描画処理
//-------------------------------
void CBackGroundManager::Draw()
{
	c_sky.Draw();

}


//-------------------------------
//		終了処理
//-------------------------------
void CBackGroundManager::Fin()
{
}