#include "PlayCamera.h"
#include "../human/Human.h"
#include <math.h>
#include "../../lib/Input/Input.h"

//	定義関連------------------------------
static const float CAMERA_LENGTH = 50.0f;		// 注視点から視点までの距離
static const float CAMERA_OFFSET_Y = 20.0f;		// 視点の高さ
//----------------------------------------


//-------------------------------
//		コンストラクタ
//-------------------------------
CPlayCamera::CPlayCamera()
{
	m_cameraRotY = 3.0f;
}


//-------------------------------
//		デストラクタ
//-------------------------------
CPlayCamera::~CPlayCamera()
{
}


//-------------------------------
//		毎フレーム呼ぶ処理
//-------------------------------
void CPlayCamera::Step(CCat& cat)
{
    //---------------------------------
    // プレイヤー位置
    //---------------------------------
    VECTOR focus = cat.GetPos();

    //---------------------------------
    // カメラ角度（固定）
    //---------------------------------
    float rotY = DX_PI_F / 4.0f; // 45度

    //---------------------------------
    // カメラ距離
    //---------------------------------
    float distance = 25.0f;//15

    //---------------------------------
    // カメラ高さ
    //---------------------------------
    float height = 23.0f;

    //---------------------------------
    // 斜め後ろ位置
    //---------------------------------
    VECTOR offset;

    offset.x = sinf(rotY) * distance;
    offset.y = height;
    offset.z = -cosf(rotY) * distance;

    //---------------------------------
    // カメラ位置
    //---------------------------------
    m_pos = VAdd(focus, offset);

    //---------------------------------
    // 注視点
    //---------------------------------
    m_focus = focus;
    m_focus.y += 5.0f;
}

